Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/cy_wcm.c
    return (*((cy_rslt_t *)api_response.result));
}

static cy_rslt_t deregister_virtual_wcm_event_handler()
{
    CY_SECTION_SHAREDMEM
    static cy_wcm_deregister_event_callback_params_t params;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_vcm_request_t   api_request;
    cy_vcm_response_t  api_response;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "De-register the callback with the secondary core as all WCM callbacks are removed \r\n");

    params.event_callback = virtual_event_handler;
    memset(&api_request, 0, sizeof(cy_vcm_request_t));
    api_request.api_id = CY_VCM_API_WCM_DEREG_EVENT_CB;
    api_request.params = &params;

    result = cy_vcm_send_api_request(&api_request, &api_response);
    if( result != CY_RSLT_SUCCESS )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_vcm_send_api_request failed for cy_wcm_deregister_event_callback \n");
        return CY_RSLT_WCM_VCM_ERROR;
    }
    if(api_response.result == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "api_response.result is NULL\n");
        return CY_RSLT_WCM_VCM_ERROR;
    }
    is_virtual_event_handler_registered = false;

    return (*((cy_rslt_t *)api_response.result));
}

cy_rslt_t cy_wcm_init(cy_wcm_config_t *config)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    int i;

    UNUSED_PARAMETER(config);

    if ( is_wcm_initialized == true )
    {
        cy_wcm_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\n WCM library is already initialized. \n" );
        return res;
    }

    res = cy_rtos_init_mutex2(&event_handler_mutex, false);
    if ( res != CY_RSLT_SUCCESS )
    {
        cy_wcm_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Failed to initialize mutex. Res: 0x%x\n", res );
        return CY_RSLT_WCM_MUTEX_ERROR;
    }

    for ( i = 0; i < CY_WCM_MAXIMUM_CALLBACKS_COUNT; i++ )
    {
        virtual_wcm_event_handler[i] = NULL;
    }

    is_wcm_initialized = true;

    return res;
}

uint8_t cy_wcm_is_connected_to_ap(void)
{
    cy_vcm_request_t   api_request;
    cy_vcm_response_t  api_response;
    cy_rslt_t          res = CY_RSLT_SUCCESS;
    uint8_t            is_connected = 0;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_wcm_is_connected_to_ap starts in secondary core\n");

    if( !is_wcm_initialized )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init() \n");
        return is_connected;
    }

    /* Set API request */
    memset(&api_request, 0, sizeof(cy_vcm_request_t));
    api_request.api_id = CY_VCM_API_WCM_IS_CONNECTED_AP;
    api_request.params = NULL;

    /* Send API request */
    res = cy_vcm_send_api_request(&api_request, &api_response);
    if( res != CY_RSLT_SUCCESS )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_vcm_send_api_request failed for cy_wcm_is_connected_to_ap\n");
        return is_connected;
    }
    if( api_response.result == NULL )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "api_response.result is NULL\n");
        return is_connected;
    }
    is_connected = (*(uint8_t*)(api_response.result));
    return is_connected;
}

cy_rslt_t cy_wcm_register_event_callback(cy_wcm_event_callback_t event_callback)
{
    cy_rslt_t         result;
    uint8_t           i;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_wcm_register_event_callback starts in secondary core\n");

    if( !is_wcm_initialized )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if( event_callback == NULL )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Bad arguments to cy_wcm_register_event_callback(). \n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    cy_wcm_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n virtual_event_handler - Acquiring Mutex %p ", event_handler_mutex );
    result = cy_rtos_get_mutex( &event_handler_mutex, CY_RTOS_NEVER_TIMEOUT );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_wcm_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] ", event_handler_mutex, (unsigned int)result );
        return CY_RSLT_WCM_MUTEX_ERROR;
    }

    if( is_virtual_event_handler_registered == false )
    {
        /* First register event api_request */
        virtual_wcm_event_handler[0] = event_callback;

        result = register_virtual_wcm_event_handler();
        if( result != CY_RSLT_SUCCESS)
        {
            goto exit;
        }
    }
    else
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Event callback registration from the secondary core \n");
        for ( i = 0; i < CY_WCM_MAXIMUM_CALLBACKS_COUNT; i++ )
        {
            if ( virtual_wcm_event_handler[i] == NULL )
            {
                virtual_wcm_event_handler[i] = event_callback;
                result = CY_RSLT_SUCCESS;
                break;
            }
        }
        if(i == CY_WCM_MAXIMUM_CALLBACKS_COUNT)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Out of CY_WCM_MAXIMUM_CALLBACKS_COUNT \r\n");
            result = CY_RSLT_WCM_OUT_OF_MEMORY;
            goto exit;
        }
    }

exit:
    if( cy_rtos_set_mutex( &event_handler_mutex ) != CY_RSLT_SUCCESS )
    {
        cy_wcm_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] ", event_handler_mutex, (unsigned int)result );
    }
    cy_wcm_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n virtual_event_handler - Releasing Mutex %p ", event_handler_mutex );

    return result;
}

cy_rslt_t cy_wcm_deregister_event_callback(cy_wcm_event_callback_t event_callback)
{
    cy_rslt_t         result;
    uint8_t           i;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_wcm_deregister_event_callback starts in secondary core\n");

    if( !is_wcm_initialized )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if( event_callback == NULL )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Bad arguments to cy_wcm_deregister_event_callback(). \n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    cy_wcm_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n virtual_event_handler - Acquiring Mutex %p ", event_handler_mutex );
    result = cy_rtos_get_mutex( &event_handler_mutex, CY_RTOS_NEVER_TIMEOUT );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_wcm_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] ", event_handler_mutex, (unsigned int)result );
        return CY_RSLT_WCM_MUTEX_ERROR;
    }

