Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/cy_wcm.c
static wcm_internal_scan_t scan_handler;

typedef struct
{
    whd_ssid_t                    SSID;
    whd_mac_t                     sta_mac;
    cy_wcm_wifi_band_t            band;
    uint8_t                       key[CY_WCM_MAX_PASSPHRASE_LEN];
    uint8_t                       keylen;
    whd_security_t                security;
    cy_network_static_ip_addr_t   static_ip;
}wcm_ap_details;

static wcm_ap_details connected_ap_details;

typedef struct
{
  cy_wcm_event_t   event;
  cy_wcm_mac_t     mac_addr;
} wcm_ap_link_event;


typedef struct xtlv
{
    uint16_t    id;
    uint16_t    len;
    uint8_t     data[1];
} xtlv_t;

/******************************************************
 *               Enumerations
 ******************************************************/

/* Chanspec values. */
typedef enum
{
    WCM_WIFI_CHANSPEC_5GHZ   = 0xC0,    /**< 5-GHz radio band.   */
    WCM_WIFI_CHANSPEC_2_4GHZ = 0x00,    /**< 2.4-GHz radio band. */
    WCM_WIFI_CHANSPEC_6GHZ   = 0x80     /**< 6-GHz radio band.   */
} wcm_wifi_band_chanspec_t;

/******************************************************
 *               Variable Definitions
 ******************************************************/
/* Fixme: Static is removed as STA interface is used for WPS in cy_wcm_wps.c, once get_whd_interface API is available
 * it will be made to static again */

/* Array containing STA Wi-Fi driver and AP Wi-Fi driver */
whd_interface_t whd_ifs[MAX_WHD_INTERFACE];

bool is_wcm_initalized                 = false;
bool is_tcp_initialized                = false;
static cy_mutex_t wcm_mutex;
static cy_wcm_interface_t                current_interface;
static bool wcm_sta_link_up            = false;
static bool is_soft_ap_up              = false;
static bool is_sta_network_up          = false;
static bool is_ap_network_up           = false;
static bool is_sta_interface_created   = false;
static whd_security_t                    sta_security_type;
static cy_worker_thread_info_t           cy_wcm_worker_thread;
static bool is_olm_initialized         = false;
static void *olm_instance              = NULL;
static bool is_disconnect_triggered    = false;
static bool is_connect_triggered       = false;

whd_scan_result_t scan_result;
cy_wcm_scan_result_callback_t p_scan_calback;
cy_wcm_scan_filter_t *p_scan_filter = NULL;

static cy_timer_t sta_handshake_timer;
static cy_timer_t sta_retry_timer;
static cy_wcm_event_callback_t wcm_event_handler[CY_WCM_MAXIMUM_CALLBACKS_COUNT];
static uint16_t sta_event_handler_index   = 0xFF;
static uint16_t ap_event_handler_index    = 0xFF;
static const whd_event_num_t  sta_link_events[] = {WLC_E_LINK, WLC_E_DEAUTH_IND, WLC_E_DISASSOC_IND, WLC_E_PSK_SUP, WLC_E_CSA_COMPLETE_IND, WLC_E_NONE};
static const whd_event_num_t  ap_link_events[]  = {WLC_E_DISASSOC_IND, WLC_E_DEAUTH_IND, WLC_E_ASSOC_IND, WLC_E_REASSOC_IND, WLC_E_AUTHORIZED, WLC_E_NONE};
static bool too_many_ie_error          = false;
static bool link_up_event_received     = false;
static uint32_t retry_backoff_timeout  = DEFAULT_RETRY_BACKOFF_TIMEOUT_IN_MS;

static whd_mac_t *mac_addr_arr = NULL;
static int current_bssid_arr_length = 0;
static cy_semaphore_t stop_scan_semaphore;
static cy_semaphore_t security_type_start_scan_semaphore;
static cy_wcm_security_t ap_security;
static cy_network_interface_context *nw_ap_if_ctx;
static cy_network_interface_context *nw_sta_if_ctx;

typedef uint16_t xtlv_opts_t;

/******************************************************
 *               Static Function Declarations
 ******************************************************/
static cy_rslt_t check_ap_credentials(const cy_wcm_connect_params_t *connect_params);
static cy_rslt_t convert_connect_params(const cy_wcm_connect_params_t *connect_params, whd_ssid_t *ssid, whd_mac_t *bssid, uint8_t **key, uint8_t *keylen, whd_security_t *security, cy_network_static_ip_addr_t *static_ip_addr);
static bool is_connected_to_same_ap(const cy_wcm_connect_params_t *connect_params);
static bool check_wcm_security(cy_wcm_security_t sec);
static void internal_scan_callback(whd_scan_result_t **result_ptr, void *user_data, whd_scan_status_t status);
static void *link_events_handler(whd_interface_t ifp, const whd_event_header_t *event_header, const uint8_t *event_data, void *handler_user_data);
static void link_up(void);
static void link_down(uint32_t reason);
static void handshake_timeout_handler(cy_timer_callback_arg_t arg);
static void handshake_error_callback(void *arg);
static void lwip_ip_change_callback(cy_network_interface_context *iface_context, void *user_data);
static bool check_if_platform_supports_band(whd_interface_t interface, cy_wcm_wifi_band_t requested_band);
static void sta_link_down_handler(void* arg);
static void sta_link_up_handler(void* arg);
static void sta_link_up_renew_handler(void* arg);
void notify_ip_change(void *arg);
static cy_rslt_t network_up(whd_interface_t interface, cy_network_hw_interface_type_t iface_type, cy_network_static_ip_addr_t *static_ip_ptr);
static void network_down(whd_interface_t interface, cy_network_hw_interface_type_t iface_type);
static void hanshake_retry_timer(cy_timer_callback_arg_t arg);
static void invoke_app_callbacks(cy_wcm_event_t event_type, cy_wcm_event_data_t* arg);
static cy_wcm_security_t whd_to_wcm_security(whd_security_t sec);
static cy_wcm_bss_type_t  whd_to_wcm_bss_type(whd_bss_type_t bss_type);
static cy_wcm_wifi_band_t whd_to_wcm_band(whd_802_11_band_t band);
static whd_security_t wcm_to_whd_security(cy_wcm_security_t sec);
static uint16_t channel_to_bandwidth(wl_chanspec_t chanspec);
static void notify_connection_status(void* arg);
static cy_rslt_t check_soft_ap_config(const cy_wcm_ap_config_t *ap_config_params);
static void read_ap_config(const cy_wcm_ap_config_t *ap_config, whd_ssid_t *ssid, uint8_t **key, uint8_t *keylen, whd_security_t *security, cy_network_static_ip_addr_t *static_ip_addr);
static void* ap_link_events_handler(whd_interface_t ifp, const whd_event_header_t *event_header, const uint8_t *event_data, void *handler_user_data);
static cy_rslt_t init_whd_wifi_interface(cy_wcm_interface_t iface_type);
static bool check_if_ent_auth_types(cy_wcm_security_t auth_type);

static void unpack_xtlv_buf(const uint8_t *tlv_buf, uint16_t buflen,cy_wcm_wlan_statistics_t *stat);
static cy_rslt_t wl_counters(const uint8_t *data, cy_wcm_wlan_statistics_t *stat);
static void xtlv_unpack_xtlv(const xtlv_t *xtlv, uint16_t *type, uint16_t *len, const uint8_t **data, xtlv_opts_t opts);
static int xtlv_hdr_size(xtlv_opts_t opts, const uint8_t **data);
static int xtlv_id(const xtlv_t *elt, xtlv_opts_t opts);
static int xtlv_len(const xtlv_t *elt, xtlv_opts_t opts);
static int xtlv_size_for_data(int dlen, xtlv_opts_t opts, const uint8_t **data);
static int ltoh16_ua(const uint8_t * bytes);
static void process_scan_data(void *arg);
static void notify_scan_completed(void *arg);

/******************************************************
 *               Function Definitions
 ******************************************************/
/** Offload Manager create
 *
 * @param[in]  ifp : This is whd_interface_t pointer
 *
 * @param[in]  oflds_list: This is offload list managed by Offload Manager.
 *
 * @return @ref CY_RSLT_SUCCESS if OLM create is success or failure code.
 *
 */
CYPRESS_WEAK cy_rslt_t cy_olm_create(void *ifp, void *oflds_list)
{
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "%s \n", __func__);
    return CY_RSLT_SUCCESS;
}

