Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/cy_wcm.c
    /* We have received the security type of the interested SSID. It is possible that this
     * callback is called again with same SSID which will cause to trigger the semaphore again.
     * That will cause issues in cy_wcm_connect_ap. Setting 'result_ptr' NULL to inform WHD
     * to abort the scan.
     */
    if(result_ptr != NULL)
    {
        *result_ptr = NULL;
    }

    if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlock error %s %d\r\n", __FILE__, __LINE__);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);
}

cy_rslt_t cy_wcm_scan_security_type(void *user_data)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    cy_wcm_connect_params_t *connect_params = (cy_wcm_connect_params_t*)user_data;
    whd_ssid_t optional_ssid;

    if(!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if(cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
        return CY_RSLT_WCM_WAIT_TIMEOUT;
    }

    if(scan_handler.is_scanning)
    {
        res = CY_RSLT_WCM_SCAN_IN_PROGRESS;
        goto exit;
    }

    optional_ssid.length = (uint8_t)strlen((char*)connect_params->ap_credentials.SSID);
    memcpy(optional_ssid.value, connect_params->ap_credentials.SSID, optional_ssid.length + 1);

    res = whd_wifi_scan(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], WHD_SCAN_TYPE_ACTIVE, WHD_BSS_TYPE_ANY,
                        &optional_ssid , NULL, NULL, NULL, internal_scan_cb_get_security_type, &scan_result, user_data);
    if(res != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "whd_wifi_scan error. Result = %d \n", res);
        res = CY_RSLT_WCM_SCAN_ERROR;
        goto exit;
    }
    scan_handler.is_scanning = true;
    scan_handler.get_security_type = true;

exit:
    if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlock error %s %d\r\n", __FILE__, __LINE__);
        res = ((res != CY_RSLT_SUCCESS) ? res : CY_RSLT_WCM_MUTEX_ERROR);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    return res;
}
cy_rslt_t cy_wcm_connect_ap(cy_wcm_connect_params_t *connect_params, cy_wcm_ip_address_t *ip_addr)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    whd_ssid_t ssid;
    whd_mac_t bssid;
    uint8_t *key;
    uint8_t keylen;
    whd_security_t security;
    cy_network_static_ip_addr_t static_ip, *static_ip_ptr;
    static_ip_ptr = NULL;
    uint32_t retry_count = 0;
    cy_nw_ip_address_t ipv4_addr;
    uint32_t connection_status;
    uint8_t num_scan = 0;
#ifdef ENABLE_WCM_LOGS
    char ip_str[15];
#endif
    uint32_t ext_sae_support = 0;
    wl_bss_info_t  bss_info;
    uint8_t password_diff = 0;

    if(!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    /* Security type not specified by user then scan to figure out the security type */
    if(connect_params->ap_credentials.security == CY_WCM_SECURITY_UNKNOWN)
    {
        while(connect_params->ap_credentials.security == CY_WCM_SECURITY_UNKNOWN && num_scan < MAX_SCAN_RETRY )
        {
            res = cy_wcm_scan_security_type(connect_params);
            if (res != CY_RSLT_SUCCESS)
            {
                if (res == CY_RSLT_WCM_SCAN_IN_PROGRESS)
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Scan in progress...wait and try again \n");
                    cy_rtos_delay_milliseconds(500);
                    continue;
                }
                else
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Scan failed... \n");
                    return res;
                }
            }
            if(cy_rtos_get_semaphore(&security_type_start_scan_semaphore, NEVER_TIMEOUT, false) != CY_RSLT_SUCCESS)
            {
                 cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error unable to set the security type semaphore \n");
            }
            /* Stop scan before starting the next scan */
            whd_wifi_stop_scan(whd_ifs[CY_WCM_INTERFACE_TYPE_STA]);
            num_scan++;
        }

        if(connect_params->ap_credentials.security == CY_WCM_SECURITY_UNKNOWN)
        {
            /* Failed to get the security type of network */
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to get the security type of network \n");
            return CY_RSLT_WCM_SECURITY_NOT_FOUND;
        }
    }

    /* check password changed only for externel-SAE usage to clear PMKID cache in FW */
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "connected_ap_details.keylen:%d\n", connected_ap_details.keylen);
    if ((connected_ap_details.keylen != 0) &&
        ((connected_ap_details.security & WPA3_SECURITY) != 0) &&
        ((connect_params->ap_credentials.security & WPA3_SECURITY) != 0) &&
        ((memcmp(connect_params->ap_credentials.SSID, connected_ap_details.SSID.value, connected_ap_details.SSID.length) != 0) ||
        (memcmp(connect_params->ap_credentials.password, connected_ap_details.key, connected_ap_details.keylen) != 0)))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "PMKID clear is needed \n");
        password_diff = 1;
    }

    memset(&connected_ap_details, 0, sizeof(connected_ap_details));
    if((res = check_ap_credentials(connect_params)) != CY_RSLT_SUCCESS)
    {
        return res;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if (cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS) == CY_RSLT_SUCCESS)
    {
        whd_scan_result_t ap;
        is_disconnect_triggered = false;
        is_connect_triggered = true;
        if (is_connected_to_same_ap(connect_params))
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "already connected to same AP \n");
            /* Store the IP address before returning */

            res = cy_network_get_ip_address(nw_sta_if_ctx, &ipv4_addr);
            if(res == CY_RSLT_SUCCESS)
            {
                ip_addr->version = CY_WCM_IP_VER_V4;
                ip_addr->ip.v4 = ipv4_addr.ip.v4;
            }
            else
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to get the IP address\n");
                res = CY_RSLT_WCM_IP_ADDR_ERROR;
            }

            goto exit;
        }
        if (wcm_sta_link_up  && (cy_wcm_disconnect_ap() != CY_RSLT_SUCCESS))
        {
            /**
             *  Notify user disconnection error occurred and
             *  reset the is_wifi_connected flag to false
             */
            wcm_sta_link_up = false;
            res = CY_RSLT_WCM_STA_DISCONNECT_ERROR;
            goto exit;
        }

