Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/cy_wcm.c
        convert_connect_params(connect_params, &ssid, &bssid, &key, &keylen, &security, &static_ip);
        sta_security_type = security;

        connection_status = CY_WCM_EVENT_CONNECTING;
        whd_wifi_get_fwcap(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], &ext_sae_support);

        if((res = cy_worker_thread_enqueue(&cy_wcm_worker_thread, notify_connection_status, (void *)connection_status)) != CY_RSLT_SUCCESS)
        {
             cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : ERROR : Failed to send connection status. Err = [%lu]\r\n", __LINE__, __FUNCTION__, res);
             goto exit;
        }
        if ( ( ext_sae_support & (1 << WHD_FWCAP_SAE_EXT))
             && ((connect_params->ap_credentials.security == CY_WCM_SECURITY_WPA3_SAE)
             ||  (connect_params->ap_credentials.security == CY_WCM_SECURITY_WPA3_WPA2_PSK)))
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "calling wpa3_supplicant_sae_start\n");
            /* supplicant SAE Start */
            res = wpa3_supplicant_sae_start(ssid.value, ssid.length, key, keylen);
            if ( res != CY_RSLT_SUCCESS)
            {
                res = CY_RSLT_WCM_WPA3_SUPPLICANT_ERROR;
                goto exit;
            }

            if (password_diff == 1)
            {
                whd_wifi_pmkid_clear(whd_ifs[CY_WCM_INTERFACE_TYPE_STA]);
            }

            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wpa3_supplicant_sae_start returned res=%d\n", res);
        }

        if(!NULL_MAC(bssid.octet))
        {
            memset(&ap, 0, sizeof(whd_scan_result_t));
            ap.security = security;
            ap.SSID.length = ssid.length;
            ap.channel = CY_WCM_DEFAULT_STA_CHANNEL;
            memcpy(ap.SSID.value, ssid.value, ap.SSID.length + 1);
            memcpy(ap.BSSID.octet, bssid.octet, CY_WCM_MAC_ADDR_LEN);
            /*
             * If MAC address of a AP is know there is no need to populate channel or band
             * instead we can set the band to auto and invoke whd join
             */
            whd_wifi_set_ioctl_value(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], WLC_SET_BAND, WLC_BAND_AUTO);
            res = whd_wifi_join_specific(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], &ap, key, keylen);
        }
        else
        {
            if(connect_params->band == CY_WCM_WIFI_BAND_2_4GHZ)
            {
                whd_wifi_set_ioctl_value(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], WLC_SET_BAND, WLC_BAND_2G);
            }
            else if((connect_params->band == CY_WCM_WIFI_BAND_5GHZ) || (connect_params->band == CY_WCM_WIFI_BAND_6GHZ))
            {
                /* check if this band is supported locally */
                if(check_if_platform_supports_band(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], connect_params->band))
                {
                    whd_wifi_set_ioctl_value(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], WLC_SET_BAND, connect_params->band);
                }
                else
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "band not supported \n");
                    res =  CY_RSLT_WCM_BAND_NOT_SUPPORTED;
                    connection_status = CY_WCM_EVENT_CONNECT_FAILED;
                    if((cy_worker_thread_enqueue(&cy_wcm_worker_thread, notify_connection_status, (void *)connection_status)) != CY_RSLT_SUCCESS)
                    {
                        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : ERROR : Failed to send connection status. Err = [%lu]\r\n", __LINE__, __FUNCTION__, res);
                    }
                    goto exit;
                }
            }
            else
            {
                /* If band is not specified set the band to AUTO */
                whd_wifi_set_ioctl_value(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], WLC_SET_BAND, WLC_BAND_AUTO);
            }
            /** Join to Wi-Fi AP **/
            res = whd_wifi_join(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], &ssid, security, key, keylen);
        }
        if (res != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "whd_wifi join failed : %ld \n", res);
            connection_status = CY_WCM_EVENT_CONNECT_FAILED;
            if((cy_worker_thread_enqueue(&cy_wcm_worker_thread, notify_connection_status, (void *)connection_status)) != CY_RSLT_SUCCESS)
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : ERROR : Failed to send connection status. Err = [%lu]\r\n", __LINE__, __FUNCTION__, res);
            }
            goto exit;
        }

        /* Call Offload init after connect to AP */
        if ((is_olm_initialized == false) && ( olm_instance != NULL))
        {
            cy_olm_init_ols(olm_instance, whd_ifs[CY_WCM_INTERFACE_TYPE_STA], NULL);
            is_olm_initialized = true;
        }

        if (!is_sta_network_up)
        {
            if(connect_params->static_ip_settings != NULL)
            {
                static_ip_ptr = &static_ip;
            }

            if((res = network_up(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], CY_NETWORK_WIFI_STA_INTERFACE, static_ip_ptr)) != CY_RSLT_SUCCESS)
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to bring up the network stack\n");
                res = CY_RSLT_WCM_STA_NETWORK_DOWN;
                connection_status = CY_WCM_EVENT_CONNECT_FAILED;
                if((cy_worker_thread_enqueue(&cy_wcm_worker_thread, notify_connection_status, (void *)connection_status)) != CY_RSLT_SUCCESS)
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : ERROR : Failed to send connection status. Err = [%lu]\r\n", __LINE__, __FUNCTION__, res);
                }
                goto exit;
            }

            /** wait in busy loop till dhcp starts and ip address gets assigned **/
            while (true)
            {
                res = cy_network_get_ip_address(nw_sta_if_ctx, &ipv4_addr);
                if (res == CY_RSLT_SUCCESS)
                {
#ifdef ENABLE_WCM_LOGS
                    cy_nw_ntoa(&ipv4_addr, ip_str);
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IPV4 Address %s assigned \n", ip_str);
#endif
                    if(ip_addr != NULL)
                    {
                        ip_addr->version = CY_WCM_IP_VER_V4;
                        ip_addr->ip.v4 = ipv4_addr.ip.v4;
                    }
                    break;
                }
                // TO DO : get ipv6 address
                /* Delay of 10 ms */
                cy_rtos_delay_milliseconds(10);
                /* Increment count for every 10 ms */
                retry_count++;
                /* Return DHCP Timeout Error when it exceeds 6000 * 10 ms = 60 seconds */
                if (retry_count > DHCP_TIMEOUT_COUNT)
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "DHCP Timeout \n");
                    /* do disconnect to bring network down as DHCP failed */
                    if (cy_wcm_disconnect_ap() != CY_RSLT_SUCCESS)
                    {
                        /**
                         *  Notify user disconnection error occurred and
                         *  reset the is_wifi_connected flag to false
                         */
                        wcm_sta_link_up = false;
                        res = CY_RSLT_WCM_STA_DISCONNECT_ERROR;
                        connection_status = CY_WCM_EVENT_CONNECT_FAILED;
                        if(cy_worker_thread_enqueue(&cy_wcm_worker_thread, notify_connection_status, (void *)connection_status) != CY_RSLT_SUCCESS)
                        {
                            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : ERROR : Failed to send connection status. Err = [%lu]\r\n", __LINE__, __FUNCTION__, res);
                        }
                        goto exit;
                    }
                    /* Return DHCP Timeout Error when DHCP discover failed and disconnect done properly */
                    res = CY_RSLT_WCM_DHCP_TIMEOUT;
                    connection_status = CY_WCM_EVENT_CONNECT_FAILED;
                    if(cy_worker_thread_enqueue(&cy_wcm_worker_thread, notify_connection_status, (void *)connection_status) != CY_RSLT_SUCCESS)
                    {
                        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : ERROR : Failed to send connection status. Err = [%lu]\r\n", __LINE__, __FUNCTION__, res);
                    }
                    goto exit;
                }
            }

            /* Register for Link events*/
            res = whd_management_set_event_handler(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], sta_link_events, link_events_handler, NULL, &sta_event_handler_index);
            if(res != CY_RSLT_SUCCESS)
            {
                /* bring down the network and leave */
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to register for Link events \n");
                network_down(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], CY_NETWORK_WIFI_STA_INTERFACE);
                whd_wifi_leave(whd_ifs[CY_WCM_INTERFACE_TYPE_STA]);
                connection_status = CY_WCM_EVENT_CONNECT_FAILED;
                if(cy_worker_thread_enqueue(&cy_wcm_worker_thread, notify_connection_status, (void *)connection_status) != CY_RSLT_SUCCESS)
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : ERROR : Failed to send connection status. Err = [%lu]\r\n", __LINE__, __FUNCTION__, res);
                }
                goto exit;
            }

            if(connect_params->itwt_profile != CY_WCM_ITWT_PROFILE_NONE)
            {
                /* iTWT parameter values are based on the band, so first get the band */
                res = whd_wifi_get_bss_info(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], &bss_info);
                if(res == CY_RSLT_SUCCESS)
                {
                    uint8_t band = 0;
                    whd_itwt_setup_params_t twt_params;
                    twt_params.setup_cmd = 2;
                    twt_params.trigger = true;
                    twt_params.flow_type = true;
                    twt_params.flow_id = 0;
                    twt_params.wake_duration = 8;
                    twt_params.exponent = 10;
                    twt_params.mantissa = 600;
                    twt_params.wake_time_h = 0;
                    twt_params.wake_time_l = 0;

