Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/cy_wcm.c
        ip_addr++;
        if(is_soft_ap_up == false)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Network is not up, call cy_wcm_connect_ap API to bring network up \r\n");
            /** Network is not up and hence mem setting the ip address to zero**/
            memset(ip_addr, 0, sizeof(cy_wcm_ip_address_t));
        }
        res = cy_network_get_ip_address(nw_ap_if_ctx, &ipv4_addr);
        if(res != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to get the IP address\n");
            return CY_RSLT_WCM_IP_ADDR_ERROR;
        }
        ip_addr->version = CY_WCM_IP_VER_V4;
        ip_addr->ip.v4 = ipv4_addr.ip.v4;
#ifdef ENABLE_WCM_LOGS
        cy_nw_ntoa(&ipv4_addr, ip_str);
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Soft AP IP Address %s assigned \n", ip_str);
#endif
    }
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_wcm_get_ipv6_addr(cy_wcm_interface_t interface_type, cy_wcm_ipv6_type_t ipv6_addr_type, cy_wcm_ip_address_t *ip_addr)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    cy_nw_ip_address_t ipv6_addr;
    cy_network_ipv6_type_t ipv6_type;
#ifdef ENABLE_WCM_LOGS
    char ip_str[39];
#endif
    if(!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if((interface_type != CY_WCM_INTERFACE_TYPE_AP_STA) && (interface_type  != CY_WCM_INTERFACE_TYPE_STA) && (interface_type != CY_WCM_INTERFACE_TYPE_AP))
    {
        return CY_RSLT_WCM_INTERFACE_NOT_SUPPORTED;
    }

    if(ip_addr == NULL)
    {
        return CY_RSLT_WCM_BAD_ARG;
    }

    if(ipv6_addr_type != CY_WCM_IPV6_LINK_LOCAL)
    {
        /*TODO : Need to add support for Global IPV6 address */
        return CY_RSLT_WCM_IPV6_GLOBAL_ADDRESS_NOT_SUPPORTED;
    }
    ipv6_type = CY_NETWORK_IPV6_LINK_LOCAL;

    if(interface_type == CY_WCM_INTERFACE_TYPE_STA)
    {
        if(is_sta_network_up == false)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Network is not up, call cy_wcm_connect_ap API to bring network up \r\n");
            /** Network is not up and hence mem setting the ip address to zero**/
            memset(ip_addr, 0, sizeof(cy_wcm_ip_address_t));
            return CY_RSLT_WCM_STA_NETWORK_DOWN;
        }

        res = cy_network_get_ipv6_address(nw_sta_if_ctx, ipv6_type, &ipv6_addr);
        if(res == CY_RSLT_SUCCESS)
        {
            ip_addr->version = CY_WCM_IP_VER_V6;
            ip_addr->ip.v6[0] = ipv6_addr.ip.v6[0];
            ip_addr->ip.v6[1] = ipv6_addr.ip.v6[1];
            ip_addr->ip.v6[2] = ipv6_addr.ip.v6[2];
            ip_addr->ip.v6[3] = ipv6_addr.ip.v6[3];

#ifdef ENABLE_WCM_LOGS
            cy_nw_ntoa_ipv6(&ipv6_addr, ip_str);
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IPV6 Address %s assigned \n", ip_str);
#endif
        }
        else
        {
            memset(ip_addr, 0, sizeof(cy_wcm_ip_address_t));
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "IPV6 network not ready \n");
            return CY_RSLT_WCM_IPV6_INTERFACE_NOT_READY;
        }
    }
    else if(interface_type == CY_WCM_INTERFACE_TYPE_AP)
    {
        if(is_soft_ap_up == false)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Network is not up, call cy_wcm_start_ap API to start SoftAP \r\n");
            /** Network is not up and hence mem setting the ip address to zero**/
            memset(ip_addr, 0, sizeof(cy_wcm_ip_address_t));
            return CY_RSLT_WCM_AP_NOT_UP;
        }

        res = cy_network_get_ipv6_address(nw_ap_if_ctx, ipv6_type, &ipv6_addr);
        if(res == CY_RSLT_SUCCESS)
        {
            ip_addr->version = CY_WCM_IP_VER_V6;
            ip_addr->ip.v6[0] = ipv6_addr.ip.v6[0];
            ip_addr->ip.v6[1] = ipv6_addr.ip.v6[1];
            ip_addr->ip.v6[2] = ipv6_addr.ip.v6[2];
            ip_addr->ip.v6[3] = ipv6_addr.ip.v6[3];
#ifdef ENABLE_WCM_LOGS
            cy_nw_ntoa_ipv6(&ipv6_addr, ip_str);
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IPV6 Address %s assigned \n", ip_str);
#endif
        }
        else
        {
            memset(ip_addr, 0, sizeof(cy_wcm_ip_address_t));
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "IPV6 network not ready \n");
            return CY_RSLT_WCM_IPV6_INTERFACE_NOT_READY;
        }
    }
    else
    {
        /* fill the 0th index with STA IP address and 1st index with AP IP address */
        if(is_sta_network_up == false)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Network is not up, call cy_wcm_connect_ap API to bring network up \r\n");
            /** Network is not up and hence mem setting the ip address to zero**/
            memset(ip_addr, 0, sizeof(cy_wcm_ip_address_t));
        }

        res = cy_network_get_ipv6_address(nw_sta_if_ctx, ipv6_type, &ipv6_addr);
        if(res == CY_RSLT_SUCCESS)
        {
            ip_addr->version = CY_WCM_IP_VER_V6;
            ip_addr->ip.v6[0] = ipv6_addr.ip.v6[0];
            ip_addr->ip.v6[1] = ipv6_addr.ip.v6[1];
            ip_addr->ip.v6[2] = ipv6_addr.ip.v6[2];
            ip_addr->ip.v6[3] = ipv6_addr.ip.v6[3];

#ifdef ENABLE_WCM_LOGS
            cy_nw_ntoa_ipv6(&ipv6_addr, ip_str);
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IPV6 Address %s assigned \n", ip_str);
#endif
        }
        else
        {
            memset(ip_addr, 0, sizeof(cy_wcm_ip_address_t));
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "IPV6 network not ready \n");
        }

        ip_addr++;
        if(is_soft_ap_up == false)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Network is not up, call cy_wcm_start_ap API to start SoftAP \r\n");
            /** Network is not up and hence mem setting the ip address to zero**/
            memset(ip_addr, 0, sizeof(cy_wcm_ip_address_t));
        }

        res = cy_network_get_ipv6_address(nw_ap_if_ctx, ipv6_type, &ipv6_addr);
        if(res == CY_RSLT_SUCCESS)
        {
            ip_addr->version = CY_WCM_IP_VER_V6;
            ip_addr->ip.v6[0] = ipv6_addr.ip.v6[0];
            ip_addr->ip.v6[1] = ipv6_addr.ip.v6[1];
            ip_addr->ip.v6[2] = ipv6_addr.ip.v6[2];
            ip_addr->ip.v6[3] = ipv6_addr.ip.v6[3];
#ifdef ENABLE_WCM_LOGS
            cy_nw_ntoa_ipv6(&ipv6_addr, ip_str);
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IPV6 Address %s assigned \n", ip_str);
#endif
        }
        else
        {
            memset(ip_addr, 0, sizeof(cy_wcm_ip_address_t));
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "IPV6 network not ready \n");
        }
    }

    return CY_RSLT_SUCCESS;
}

