Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/cy_wcm.c
cy_rslt_t cy_wcm_get_mac_addr(cy_wcm_interface_t interface_type, cy_wcm_mac_t *mac_addr)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    whd_mac_t mac;

    if(!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if((interface_type != CY_WCM_INTERFACE_TYPE_AP_STA) && (interface_type  != CY_WCM_INTERFACE_TYPE_STA) && (interface_type != CY_WCM_INTERFACE_TYPE_AP))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Interface not supported \r\n");
        return CY_RSLT_WCM_INTERFACE_NOT_SUPPORTED;
    }

    if(mac_addr == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Bad argument \r\n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if(cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
        return CY_RSLT_WCM_WAIT_TIMEOUT;
    }

    if(((current_interface == CY_WCM_INTERFACE_TYPE_AP) && (interface_type == CY_WCM_INTERFACE_TYPE_STA)))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : Interface is not up \r\n");
        res = CY_RSLT_WCM_INTERFACE_NOT_UP;
        memset(mac_addr, 0, sizeof(mac));
        goto exit;
    }

    if((current_interface == CY_WCM_INTERFACE_TYPE_STA) && (interface_type == CY_WCM_INTERFACE_TYPE_AP))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : Interface is not up \r\n");
        res = CY_RSLT_WCM_INTERFACE_NOT_UP;
        memset(mac_addr, 0, sizeof(mac));
        goto exit;
    }

    memset(&mac, 0, sizeof(whd_mac_t));
    if((interface_type == CY_WCM_INTERFACE_TYPE_STA) || (interface_type == CY_WCM_INTERFACE_TYPE_AP))
    {
        if((res = whd_wifi_get_mac_address(whd_ifs[interface_type], &mac) != CY_RSLT_SUCCESS))
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error in getting the mac address of the interface \r\n");
            memset(mac_addr, 0, sizeof(mac));
            goto exit;
        }
        memcpy(mac_addr, &mac, sizeof(mac));
    }
    else
    {
        memset(mac_addr, 0, (MAX_WHD_INTERFACE * sizeof(mac)));
        if((res = whd_wifi_get_mac_address(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], &mac)) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error in getting the mac address of STA interface \r\n");
            goto exit;
        }
        else
        {
            memcpy(mac_addr, &mac, sizeof(mac));
        }

        mac_addr++;
        memset(&mac, 0, sizeof(whd_mac_t));

        if((res = whd_wifi_get_mac_address(whd_ifs[CY_WCM_INTERFACE_TYPE_AP], &mac)) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error in getting the mac address of AP interface \r\n");
        }
        else
        {
            memcpy(mac_addr, &mac, sizeof(mac));
        }
    }
 exit:
    if(cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        res = ((res != CY_RSLT_SUCCESS) ? res : CY_RSLT_WCM_MUTEX_ERROR);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    return res;
}

cy_rslt_t cy_wcm_get_gateway_ip_address(cy_wcm_interface_t interface_type, cy_wcm_ip_address_t *gateway_addr)
{
    cy_nw_ip_address_t ipv4_addr;
    cy_rslt_t res = CY_RSLT_SUCCESS;
#ifdef ENABLE_WCM_LOGS
    char ip_str[15];
#endif

    if(!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if((interface_type != CY_WCM_INTERFACE_TYPE_AP_STA) && (interface_type  != CY_WCM_INTERFACE_TYPE_STA) && (interface_type != CY_WCM_INTERFACE_TYPE_AP))
    {
        return CY_RSLT_WCM_INTERFACE_NOT_SUPPORTED;
    }

    if(gateway_addr == NULL)
    {
        return CY_RSLT_WCM_BAD_ARG;
    }

    if(interface_type == CY_WCM_INTERFACE_TYPE_STA)
    {
        if(is_sta_network_up == false)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Network is not up, call cy_wcm_connect_ap API to bring network up \r\n");
            /** Network is not up and hence mem setting the ip address to zero**/
            memset(gateway_addr, 0, sizeof(cy_wcm_ip_address_t));
            return CY_RSLT_WCM_STA_NETWORK_DOWN;
        }

        res = cy_network_get_gateway_ip_address(nw_sta_if_ctx, &ipv4_addr);
        if(res != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to get the gateway address\n");
            return CY_RSLT_WCM_GATEWAY_ADDR_ERROR;
        }
        gateway_addr->version = CY_WCM_IP_VER_V4;
        gateway_addr->ip.v4 = ipv4_addr.ip.v4;
#ifdef ENABLE_WCM_LOGS
        cy_nw_ntoa(&ipv4_addr, ip_str);
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Gateway IP Address %s assigned \n", ip_str);
#endif
        return CY_RSLT_SUCCESS;
    }
    else if(interface_type == CY_WCM_INTERFACE_TYPE_AP)
    {
        if(is_soft_ap_up == false)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Network is not up, call cy_wcm_connect_ap API to bring network up \r\n");
            /** Network is not up and hence mem setting the ip address to zero**/
            memset(gateway_addr, 0, sizeof(cy_wcm_ip_address_t));
            return CY_RSLT_WCM_STA_NETWORK_DOWN;
        }
        res = cy_network_get_gateway_ip_address(nw_ap_if_ctx, &ipv4_addr);
        if(res != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to get the gateway address\n");
            return CY_RSLT_WCM_GATEWAY_ADDR_ERROR;
        }
        gateway_addr->version = CY_WCM_IP_VER_V4;
        gateway_addr->ip.v4 = ipv4_addr.ip.v4;
#ifdef ENABLE_WCM_LOGS
        cy_nw_ntoa(&ipv4_addr, ip_str);
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Gateway IP Address %s assigned \n", ip_str);
#endif
        return CY_RSLT_SUCCESS;
    }
    else
    {
        /* fill the 0th index with STA IP address and 1st index with AP IP address */
        if(is_sta_network_up == false)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Network is not up, call cy_wcm_connect_ap API to bring network up \r\n");
            /** Network is not up and hence mem setting the ip address to zero**/
            memset(gateway_addr, 0, sizeof(cy_wcm_ip_address_t));
        }
        res = cy_network_get_gateway_ip_address(nw_sta_if_ctx, &ipv4_addr);
        if(res != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to get the gateway address\n");
            return CY_RSLT_WCM_GATEWAY_ADDR_ERROR;
        }
        gateway_addr->version = CY_WCM_IP_VER_V4;
        gateway_addr->ip.v4 = ipv4_addr.ip.v4;
#ifdef ENABLE_WCM_LOGS
        cy_nw_ntoa(&ipv4_addr, ip_str);
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "STA Gateway IP Address %s assigned \n", ip_str);
#endif

        gateway_addr++;
        if(is_soft_ap_up == false)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Network is not up, call cy_wcm_connect_ap API to bring network up \r\n");
            /** Network is not up and hence mem setting the ip address to zero**/
            memset(gateway_addr, 0, sizeof(cy_wcm_ip_address_t));
        }
        res = cy_network_get_gateway_ip_address(nw_ap_if_ctx, &ipv4_addr);
        if(res != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to get the gateway address\n");
            return CY_RSLT_WCM_GATEWAY_ADDR_ERROR;
        }
        gateway_addr->version = CY_WCM_IP_VER_V4;
        gateway_addr->ip.v4 = ipv4_addr.ip.v4;
#ifdef ENABLE_WCM_LOGS
        cy_nw_ntoa(&ipv4_addr, ip_str);
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Soft AP IP Address %s assigned \n", ip_str);
#endif
    }
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_wcm_get_ip_netmask(cy_wcm_interface_t interface_type, cy_wcm_ip_address_t *net_mask_addr)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    cy_nw_ip_address_t ipv4_addr;
#ifdef ENABLE_WCM_LOGS
    char ip_str[15];
#endif
    if(!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if((interface_type != CY_WCM_INTERFACE_TYPE_AP_STA) && (interface_type  != CY_WCM_INTERFACE_TYPE_STA) && (interface_type != CY_WCM_INTERFACE_TYPE_AP))
    {
        return CY_RSLT_WCM_INTERFACE_NOT_SUPPORTED;
    }

    if(net_mask_addr == NULL)
    {
        return CY_RSLT_WCM_BAD_ARG;
    }

    if(interface_type == CY_WCM_INTERFACE_TYPE_STA)
    {
        if(is_sta_network_up == false)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Network is not up, call cy_wcm_connect_ap API to bring network up \r\n");
            /** Network is not up and hence mem setting the ip address to zero**/
            memset(net_mask_addr, 0, sizeof(cy_wcm_ip_address_t));
            return CY_RSLT_WCM_STA_NETWORK_DOWN;
        }

        res = cy_network_get_netmask_address(nw_sta_if_ctx, &ipv4_addr);
        if(res != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to get the netmask address\n");
            return CY_RSLT_WCM_NETMASK_ADDR_ERROR;
        }

        net_mask_addr->version = CY_WCM_IP_VER_V4;
        net_mask_addr->ip.v4 = ipv4_addr.ip.v4;
#ifdef ENABLE_WCM_LOGS
        cy_nw_ntoa(&ipv4_addr, ip_str);
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "net mask IP Address %s assigned \n", ip_str);
#endif
        return CY_RSLT_SUCCESS;
    }
    else if(interface_type == CY_WCM_INTERFACE_TYPE_AP)
    {
        if(is_soft_ap_up == false)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Network is not up, call cy_wcm_connect_ap API to bring network up \r\n");
            /** Network is not up and hence mem setting the ip address to zero**/
            memset(net_mask_addr, 0, sizeof(cy_wcm_ip_address_t));
            return CY_RSLT_WCM_STA_NETWORK_DOWN;
        }

