Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/cy_wcm.c
        res = cy_network_get_netmask_address(nw_ap_if_ctx, &ipv4_addr);
        if(res != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to get the IP address\n");
            return CY_RSLT_WCM_IP_ADDR_ERROR;
        }
        net_mask_addr->version = CY_WCM_IP_VER_V4;
        net_mask_addr->ip.v4 = ipv4_addr.ip.v4;
#ifdef ENABLE_WCM_LOGS
        cy_nw_ntoa(&ipv4_addr, ip_str);
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "net mask Address %s assigned \n", ip_str);
#endif
        return CY_RSLT_SUCCESS;
    }
    else
    {
        /* fill the 0th index with STA IP address and 1st index with AP IP address */
        if(is_sta_network_up == false)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Network is not up, call cy_wcm_connect_ap API to bring network up \r\n");
            /** Network is not up and hence mem setting the ip address to zero**/
            memset(net_mask_addr, 0, sizeof(cy_wcm_ip_address_t));
        }

        res = cy_network_get_netmask_address(nw_sta_if_ctx, &ipv4_addr);
        if(res != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to get the IP address\n");
            return CY_RSLT_WCM_IP_ADDR_ERROR;
        }
        net_mask_addr->version = CY_WCM_IP_VER_V4;
        net_mask_addr->ip.v4 = ipv4_addr.ip.v4;
#ifdef ENABLE_WCM_LOGS
        cy_nw_ntoa(&ipv4_addr, ip_str);
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "STA Gateway IP Address %s assigned \n", ip_str);
#endif

        net_mask_addr++;
        if(is_soft_ap_up == false)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Network is not up, call cy_wcm_connect_ap API to bring network up \r\n");
            /** Network is not up and hence mem setting the ip address to zero**/
            memset(net_mask_addr, 0, sizeof(cy_wcm_ip_address_t));
        }
        res = cy_network_get_netmask_address(nw_ap_if_ctx, &ipv4_addr);
        if(res != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to get the IP address\n");
            return CY_RSLT_WCM_IP_ADDR_ERROR;
        }
        net_mask_addr->version = CY_WCM_IP_VER_V4;
        net_mask_addr->ip.v4 = ipv4_addr.ip.v4;
#ifdef ENABLE_WCM_LOGS
        cy_nw_ntoa(&ipv4_addr, ip_str);
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Soft AP net mask Address %s assigned \n", ip_str);
#endif
    }
    return CY_RSLT_SUCCESS;
}

uint8_t cy_wcm_is_connected_to_ap(void)
{
    return (wcm_sta_link_up ? 1 : 0);
}

uint8_t cy_wcm_is_ap_up(void)
{
    return (is_soft_ap_up ? 1 : 0);
}

cy_rslt_t cy_wcm_get_associated_ap_info(cy_wcm_associated_ap_info_t *ap_info)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    wl_bss_info_t  bss_info;
    whd_security_t security;

    if(!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if(ap_info == NULL)
    {
        return CY_RSLT_WCM_BAD_ARG;
    }

    if(!wcm_sta_link_up)
    {
        return CY_RSLT_WCM_STA_NETWORK_DOWN;
    }

    if(whd_wifi_get_ap_info(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], &bss_info, &security) == CY_RSLT_SUCCESS)
    {
        memcpy(ap_info->BSSID, bss_info.BSSID.octet, CY_WCM_MAC_ADDR_LEN);
        memcpy(ap_info->SSID, bss_info.SSID, bss_info.SSID_len);
        ap_info->SSID[bss_info.SSID_len] = 0;
        ap_info->security = whd_to_wcm_security(security);
        ap_info->channel = bss_info.ctl_ch;
        ap_info->signal_strength = bss_info.RSSI;
        ap_info->channel_width = channel_to_bandwidth(bss_info.chanspec);
        if(ap_info->channel_width == UNKNOWN_BAND_WIDTH)
        {
            res = CY_RSLT_WCM_CHANNEL_ERROR;
        }
    }

    return res;
}

static int ltoh16_ua(const uint8_t * bytes)
{
    const uint8_t *_bytes = (const uint8_t *)(bytes);
    return _LTOH16_UA(_bytes);

}

static int xtlv_size_for_data(int dlen, xtlv_opts_t opts, const uint8_t **data)
{
    int hsz;
    hsz = xtlv_hdr_size(opts, data);
    return ((opts & XTLV_OPTION_ALIGN32) ? ALIGN_SIZE(dlen + hsz, 4) : (dlen + hsz));
}

static int xtlv_len(const xtlv_t *elt, xtlv_opts_t opts)
{
    const uint8_t *lenp;
    int len;

    lenp = (const uint8_t *)&elt->len; /* nominal */
    if (opts & XTLV_OPTION_IDU8)
    {
        --lenp;
    }
    if (opts & XTLV_OPTION_LENU8)
    {
        len = *lenp;
    }
    else
    {
        len = ltoh16_ua(lenp);
    }
    return len;
}

static int xtlv_id(const xtlv_t *elt, xtlv_opts_t opts)
{
    int id = 0;
    if (opts & XTLV_OPTION_IDU8)
    {
        id =  *(const uint8_t *)elt;
    }
    else
    {
        id = ltoh16_ua((const uint8_t *)elt);
    }
    return id;
}

static int xtlv_hdr_size(xtlv_opts_t opts, const uint8_t **data)
{
    int len = (int)OFFSETOF(xtlv_t, data); /* nominal */
    if (opts & XTLV_OPTION_LENU8)
    {
        --len;
    }
    if (opts & XTLV_OPTION_IDU8)
    {
        --len;
    }
    return len;
}

static void xtlv_unpack_xtlv(const xtlv_t *xtlv, uint16_t *type, uint16_t *len,
    const uint8_t **data, xtlv_opts_t opts)
{
    if (type)
    {
        *type = (uint16_t)xtlv_id(xtlv, opts);
    }
    if (len)
    {
        *len = (uint16_t)xtlv_len(xtlv, opts);
    }
    if (data)
    {
        *data = (const uint8_t *)xtlv + xtlv_hdr_size(opts, data);
    }
}

static void unpack_xtlv_buf(const uint8_t *tlv_buf, uint16_t buflen,cy_wcm_wlan_statistics_t *stat)
{
    uint16_t len;
    uint16_t type;
    int size;
    const xtlv_t *ptlv;
    int sbuflen = buflen;
    const uint8_t *data;
    int hdr_size;

    hdr_size = xtlv_hdr_size(XTLV_OPTION_ALIGN32, &data);
    while (sbuflen >= hdr_size) {
        ptlv = (const xtlv_t *)tlv_buf;

        xtlv_unpack_xtlv(ptlv, &type, &len, &data, XTLV_OPTION_ALIGN32);
        size = xtlv_size_for_data(len, XTLV_OPTION_ALIGN32, &data);

        sbuflen -= size;
        if (sbuflen < 0) /* check for buffer overrun */
        {
            break;
        }
        if (type == 0x100)
        {
            if(wl_counters(data, stat) == CY_RSLT_SUCCESS)
            {
                break;
            }
        }
        tlv_buf += size;
    }
    return;
}

