Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/cy_wcm.c
static cy_rslt_t wl_counters(const uint8_t *data, cy_wcm_wlan_statistics_t *stat)
{
    wl_cnt_ver_30_t *cnt = (wl_cnt_ver_30_t *)data;
    stat->rx_bytes   = cnt->rxbyte;
    stat->tx_bytes   = cnt->txbyte;
    stat->rx_packets = cnt->rxfrag;
    stat->tx_packets = cnt->txfrag;
    stat->tx_failed  = cnt->txfail;
    stat->tx_retries = cnt->txretry;
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_wcm_get_wlan_statistics(cy_wcm_interface_t interface, cy_wcm_wlan_statistics_t *stat)
{
    uint32_t data_rate;
    wl_cnt_ver_ten_t* received_counters;
    uint8_t buffer[WLC_IOCTL_MEDLEN];
    wl_cnt_info_t* wl_cnt_info ;

    if(!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if(interface != CY_WCM_INTERFACE_TYPE_STA)
    {
        return CY_RSLT_WCM_INTERFACE_NOT_SUPPORTED;
    }

    if(stat == NULL)
    {
        return CY_RSLT_WCM_BAD_ARG;
    }

    CHECK_RETURN(whd_wifi_get_iovar_buffer(whd_ifs[ CY_WCM_INTERFACE_TYPE_STA], IOVAR_STR_COUNTERS, buffer, WLC_IOCTL_MEDLEN));
    wl_cnt_info = (wl_cnt_info_t * )buffer;

    if (wl_cnt_info->version == WL_CNT_VER_30)
    {
        /* 43012 board - Process xtlv buffer data to get statistics */
        uint8_t *cntdata;
        cntdata = (uint8_t *)malloc(wl_cnt_info->datalen);

        CHK_CNTBUF_DATALEN(wl_cnt_info, WLC_IOCTL_MEDLEN);
        if (cntdata == NULL) {
            return CY_RSLT_TYPE_ERROR;
        }
        memcpy(cntdata, wl_cnt_info->data, wl_cnt_info->datalen);
        unpack_xtlv_buf(cntdata, wl_cnt_info->datalen, stat);
        free(cntdata);
    }
    else if (wl_cnt_info->version == WL_CNT_VER_10)
    {
        received_counters =(wl_cnt_ver_ten_t*)  wl_cnt_info;

        /* Copy the required statistics */
        stat->rx_bytes   = received_counters->rxbyte;
        stat->tx_bytes   = received_counters->txbyte;
        stat->rx_packets = received_counters->rxfrag;
        stat->tx_packets = received_counters->txfrag;
        stat->tx_failed  = received_counters->txfail;
        stat->tx_retries = received_counters->txretry;
    }

    /* get data rate */
    CHECK_RETURN (whd_wifi_get_ioctl_value(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], WLC_GET_RATE, &data_rate));
    /* The data rate received is in units of 500Kbits per sec, convert to Kbits per sec*/
    stat->tx_bitrate = (data_rate * TX_BIT_RATE_CONVERTER);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_wcm_get_gateway_mac_address(cy_wcm_mac_t *mac_addr)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    cy_nw_ip_mac_t nw_mac_addr;

    if(!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if(mac_addr == NULL)
    {
        return CY_RSLT_WCM_BAD_ARG;
    }

    if(current_interface == CY_WCM_INTERFACE_TYPE_AP)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "feature not supported for AP interface \r\n");
        return CY_RSLT_WCM_INTERFACE_NOT_SUPPORTED;
    }

    if(!nw_sta_if_ctx->is_initialized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "network interface is NULL \r\n");
        return CY_RSLT_WCM_NETIF_DOES_NOT_EXIST;
    }

    memset(mac_addr , 0, sizeof(*mac_addr));
    res = cy_network_get_gateway_mac_address(nw_sta_if_ctx, &nw_mac_addr);
    if(res != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to get the Gateway MAC address\n");
        res = CY_RSLT_WCM_GATEWAY_MAC_ADDR_ERROR;
    }
    (*mac_addr)[0] = nw_mac_addr.mac[0];
    (*mac_addr)[1] = nw_mac_addr.mac[1];
    (*mac_addr)[2] = nw_mac_addr.mac[2];
    (*mac_addr)[3] = nw_mac_addr.mac[3];
    (*mac_addr)[4] = nw_mac_addr.mac[4];
    (*mac_addr)[5] = nw_mac_addr.mac[5];
    return res;
}

cy_rslt_t cy_wcm_ping(cy_wcm_interface_t interface, cy_wcm_ip_address_t* address, uint32_t timeout_ms, uint32_t* elapsed_time_ms)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;

    if(!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. To initialize call cy_wcm_init(). \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if((interface != CY_WCM_INTERFACE_TYPE_STA) && (interface != CY_WCM_INTERFACE_TYPE_AP))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "interface not supported \r\n");
        return CY_RSLT_WCM_INTERFACE_NOT_SUPPORTED;
    }

    if((address == NULL) || (elapsed_time_ms == NULL))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "BAD arguments \r\n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    if((interface == CY_WCM_INTERFACE_TYPE_STA) && (wcm_sta_link_up == false))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "STA network down \r\n");
        return CY_RSLT_WCM_STA_NETWORK_DOWN;
    }

    if((interface == CY_WCM_INTERFACE_TYPE_AP) && (is_soft_ap_up == false))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "AP not up \r\n");
        return CY_RSLT_WCM_AP_NOT_UP;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if(cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
        return CY_RSLT_WCM_WAIT_TIMEOUT;
    }

    /* Call cy_network_ping() */
    if(interface == CY_WCM_INTERFACE_TYPE_AP)
    {
        res = cy_network_ping((void *)nw_ap_if_ctx, (cy_nw_ip_address_t *) address, timeout_ms, elapsed_time_ms);
    }
    else
    {
        res = cy_network_ping((void *)nw_sta_if_ctx, (cy_nw_ip_address_t *) address, timeout_ms, elapsed_time_ms);
    }

    if(cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to release the mutex \n");
        res = ((res != CY_RSLT_SUCCESS) ? res : CY_RSLT_WCM_MUTEX_ERROR);
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    return res;
}

cy_rslt_t cy_wcm_start_ap(const cy_wcm_ap_config_t *ap_config)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    whd_ssid_t ssid;
    uint8_t *key;
    uint8_t keylen;
    uint16_t chanspec = 0;
    whd_security_t security;
    cy_network_static_ip_addr_t static_ip;

