Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/cy_wcm.c
void internal_scan_callback(whd_scan_result_t **result_ptr,
                             void *user_data, whd_scan_status_t status)
{
    whd_scan_result_t *whd_scan_result;
    uint32_t scan_status = status;

    /* Check if we don't have a scan result to send to the user */
    if (( result_ptr == NULL ) || ( *result_ptr == NULL ))
    {
        /* Check for scan complete */
        if (status == WHD_SCAN_COMPLETED_SUCCESSFULLY || status == WHD_SCAN_ABORTED)
        {
            /* Notify scan complete */
            if(cy_worker_thread_enqueue(&cy_wcm_worker_thread, notify_scan_completed, (void *)scan_status) != CY_RSLT_SUCCESS)
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error in calling the worker thread func \n");
            }
        }
        return;
    }

    whd_scan_result = (whd_scan_result_t *)malloc(sizeof(whd_scan_result_t));
    if (whd_scan_result == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Heap space error \n");
        goto exit;
    }
    memcpy(whd_scan_result, *result_ptr, sizeof(whd_scan_result_t));
    if(cy_worker_thread_enqueue(&cy_wcm_worker_thread, process_scan_data, whd_scan_result) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error in calling the worker thread func \n");
        free(whd_scan_result);
        goto exit;
    }

exit:
    memset(*result_ptr, 0, sizeof(whd_scan_result_t));
    return;
}

static void notify_scan_completed(void *arg)
{
    uint32_t val = (uint32_t)arg;
    whd_scan_status_t scan_status = (whd_scan_status_t)val;
    cy_wcm_scan_result_t scan_res;
    bool invoke_application_callback = false;
    memset(&scan_res, 0, sizeof(scan_res));

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if(cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
        return;
    }

    scan_handler.scan_status = scan_status;
    memset(&scan_handler.scan_res, 0x0, sizeof(whd_scan_result_t));

    /* Invoke application callback only on successful scan completion. Do not invoke application callback on Abort/stop scan */
    if(scan_status == WHD_SCAN_COMPLETED_SUCCESSFULLY)
    {
        invoke_application_callback = true;
    }

    /* Scan is completed, reset the flag */
    scan_handler.is_scanning = false;

    if(mac_addr_arr != NULL)
    {
       free(mac_addr_arr);
       mac_addr_arr = NULL;
    }

    /* Notify application appropriately based on scan status */
    if((scan_handler.p_scan_calback != NULL) && (invoke_application_callback == true))
    {
       scan_handler.p_scan_calback(NULL, scan_handler.user_data, CY_WCM_SCAN_COMPLETE);
    }

    if(scan_handler.is_stop_scan_req)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "setting stop scan semaphore %s %d\r\n", __FILE__, __LINE__);
        if(cy_rtos_set_semaphore(&stop_scan_semaphore, false) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "unable to set the stop scan semaphore \n");
        }
        scan_handler.is_stop_scan_req = false;
    }

    if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to release the WCM mutex \n");
        if(scan_res.ie_ptr != NULL)
        {
            free(scan_res.ie_ptr);
        }
        return;
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);
}


static void process_scan_data(void *arg)
{
    whd_scan_result_t *whd_scan_res = (whd_scan_result_t*)arg;
    cy_wcm_scan_result_t wcm_scan_res;
    whd_mac_t *mac_iter = NULL;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if(cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
        free(whd_scan_res);
        return;
    }

    if (scan_handler.is_scanning == false)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "scan_handler.is_scanning is false\n");
        goto exit;
    }

    /* Check for duplicate SSID */
    for (mac_iter = mac_addr_arr; (mac_iter < mac_addr_arr + current_bssid_arr_length); ++mac_iter)
    {
        if(CMP_MAC(mac_iter->octet, whd_scan_res->BSSID.octet))
        {
            /* The scanned result is a duplicate; just return */
            goto exit;
        }
    }

    /* If scanned Wi-Fi is not a duplicate then populate the array */
    if(current_bssid_arr_length < SCAN_BSSID_ARR_LENGTH)
    {
        memcpy(&mac_iter->octet, whd_scan_res->BSSID.octet, sizeof(whd_mac_t) );
        current_bssid_arr_length++;
    }

    memset(&wcm_scan_res, 0, sizeof(wcm_scan_res));

    if(scan_handler.scan_filter.mode == CY_WCM_SCAN_FILTER_TYPE_RSSI)
    {
         int16_t requested_range = scan_handler.scan_filter.param.rssi_range;
         int16_t signal_strength = whd_scan_res->signal_strength;
         if(signal_strength < requested_range)
         {
             goto exit;
         }
    }

    /** copy all the parameters to scan_res **/
    memcpy(wcm_scan_res.SSID, whd_scan_res->SSID.value, whd_scan_res->SSID.length);
    memcpy(wcm_scan_res.BSSID, whd_scan_res->BSSID.octet, sizeof(wcm_scan_res.BSSID));
    wcm_scan_res.security = whd_to_wcm_security(whd_scan_res->security);
    wcm_scan_res.band = whd_to_wcm_band(whd_scan_res->band);
    wcm_scan_res.bss_type = whd_to_wcm_bss_type(whd_scan_res->bss_type);
    memcpy(wcm_scan_res.ccode, whd_scan_res->ccode, sizeof(wcm_scan_res.ccode));
    wcm_scan_res.channel = whd_scan_res->channel;
    wcm_scan_res.signal_strength = whd_scan_res->signal_strength;
    wcm_scan_res.flags = whd_scan_res->flags;
    wcm_scan_res.ie_len = whd_scan_res->ie_len;
    wcm_scan_res.ie_ptr = (uint8_t*)malloc(wcm_scan_res.ie_len);
    if(wcm_scan_res.ie_ptr == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Heap space error \n");
        goto exit;
    }
    else
    {
        memcpy(wcm_scan_res.ie_ptr, whd_scan_res->ie_ptr, wcm_scan_res.ie_len);
    }

    /* Notify application appropriately based on scan status */
    if(scan_handler.p_scan_calback != NULL)
    {
        scan_handler.p_scan_calback(&wcm_scan_res, scan_handler.user_data, CY_WCM_SCAN_INCOMPLETE);
    }
    free(wcm_scan_res.ie_ptr);

