Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/cy_wcm.c
}

static void link_down(uint32_t reason)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    UNUSED_PARAMETER(res);
    if (wcm_sta_link_up)
    {
        if((res = cy_worker_thread_enqueue(&cy_wcm_worker_thread, sta_link_down_handler, (void *)reason)) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : ERROR : Failed to handle link down event. Err = [%lu]\r\n", __LINE__, __FUNCTION__, res);
        }
        wcm_sta_link_up = false;
    }
}

static void sta_link_down_handler(void* arg)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    cy_wcm_event_data_t event_data;

    res = cy_network_ip_down(nw_sta_if_ctx);
    if(res == CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Notify application that network is down!\n");
        /* Store the reason for disconnection as received from WHD */
        event_data.reason = (cy_wcm_reason_code)arg;
        invoke_app_callbacks(CY_WCM_EVENT_DISCONNECTED, &event_data);
    }
    is_sta_network_up = false;
}
static void hanshake_retry_timer(cy_timer_callback_arg_t arg)
{
    UNUSED_PARAMETER(arg);
    handshake_error_callback(0);
}

static void handshake_timeout_handler(cy_timer_callback_arg_t arg)
{
    cy_rslt_t result;

    UNUSED_PARAMETER( arg );

    cy_rtos_stop_timer(&sta_handshake_timer);
    cy_rtos_stop_timer(&sta_retry_timer);
    retry_backoff_timeout = DEFAULT_RETRY_BACKOFF_TIMEOUT_IN_MS;

    result = cy_worker_thread_enqueue(&cy_wcm_worker_thread, handshake_error_callback, NULL);
    if (result != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : Failed to send async event to n/w worker thread. Err = [%lu]\r\n", __LINE__, __FUNCTION__, result);
    }
}


static void handshake_error_callback(void *arg)
{
    cy_rslt_t  res;
    uint8_t    retries;
    uint32_t   ext_sae_support = 0;
    uint32_t   connection_status;

    UNUSED_PARAMETER(arg);

    /* stop the retry timer */
    cy_rtos_stop_timer(&sta_retry_timer);

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if(cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
        return;
    }
    if (is_disconnect_triggered == true || is_connect_triggered == true || cy_wcm_is_connected_to_ap())
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO,
        "is_disconnect_triggered(%d),cy_wcm_is_connected_to_ap()(%d) exit handshake_error_callback\n",
        is_disconnect_triggered, cy_wcm_is_connected_to_ap());
        goto exit;
    }
    /* De-register the link event handler */
    whd_wifi_deregister_event_handler(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], sta_event_handler_index);

    /* Explicitly leave AP and then rejoin */
    whd_wifi_leave(whd_ifs[CY_WCM_INTERFACE_TYPE_STA]);
    if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Mutex release error \n");
        return;
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    cy_rtos_delay_milliseconds(100);

    for(retries = 0; retries < JOIN_RETRY_ATTEMPTS; retries++)
    {
        cy_rslt_t join_result;
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
        if(cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
            return;
        }

        whd_wifi_get_fwcap(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], &ext_sae_support);
        if (( ext_sae_support & (1 << WHD_FWCAP_SAE_EXT)) &&
           ((connected_ap_details.security == WHD_SECURITY_WPA3_SAE) || (connected_ap_details.security == WHD_SECURITY_WPA3_WPA2_PSK)))
        {
             cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "calling wpa3_supplicant_sae_start\n");
             /* supplicant SAE Start */
             res = wpa3_supplicant_sae_start(connected_ap_details.SSID.value, connected_ap_details.SSID.length, connected_ap_details.key, connected_ap_details.keylen);
             if ( res != CY_RSLT_SUCCESS)
             {
                 res = CY_RSLT_WCM_WPA3_SUPPLICANT_ERROR;
                 goto exit;
             }
             cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wpa3_supplicant_sae_start returned res=%d\n", res);
        }

        if (is_disconnect_triggered == true || is_connect_triggered == true || cy_wcm_is_connected_to_ap())
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO,
            "is_disconnect_triggered(%d),cy_wcm_is_connected_to_ap()(%d) exit handshake_error_callback\n",
            is_disconnect_triggered, cy_wcm_is_connected_to_ap());
            goto exit;
        }

        if(!NULL_MAC(connected_ap_details.sta_mac.octet))
        {
            whd_scan_result_t ap;
            ap.security = connected_ap_details.security;
            ap.SSID.length = connected_ap_details.SSID.length;
            memcpy(ap.SSID.value, connected_ap_details.SSID.value, ap.SSID.length);
            memcpy(ap.BSSID.octet, connected_ap_details.sta_mac.octet, CY_WCM_MAC_ADDR_LEN);
            /*
             * If MAC address of a AP is know there is no need to populate channel or band
             * instead we can set the band to auto and invoke whd join
             */
            whd_wifi_set_ioctl_value(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], WLC_SET_BAND, WLC_BAND_AUTO);
            join_result = whd_wifi_join_specific(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], &ap, connected_ap_details.key, connected_ap_details.keylen);
        }
        else
        {
            if(connected_ap_details.band == CY_WCM_WIFI_BAND_5GHZ)
            {
                whd_wifi_set_ioctl_value(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], WLC_SET_BAND, WLC_BAND_5G);
            }
            else if(connected_ap_details.band == CY_WCM_WIFI_BAND_2_4GHZ)
            {
                /*
                 * It could be possible on a dual band supported device,
                 * the current band set is 5G and the requested band from user is 2.4Ghz
                 */
                whd_wifi_set_ioctl_value(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], WLC_SET_BAND, WLC_BAND_2G);
            }
            else if(connected_ap_details.band == CY_WCM_WIFI_BAND_6GHZ)
            {
                whd_wifi_set_ioctl_value(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], WLC_SET_BAND, WLC_BAND_6G);
            }
            else
            {
                whd_wifi_set_ioctl_value(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], WLC_SET_BAND, WLC_BAND_AUTO);
            }
            /** Join to Wi-Fi AP **/
            join_result = whd_wifi_join(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], &connected_ap_details.SSID, connected_ap_details.security, connected_ap_details.key, connected_ap_details.keylen);
        }

        if(join_result == CY_RSLT_SUCCESS)
        {
            link_up();
            sta_security_type = connected_ap_details.security;
            /* Register for Link events*/
            if(whd_management_set_event_handler(whd_ifs[CY_WCM_INTERFACE_TYPE_STA], sta_link_events, link_events_handler, NULL, &sta_event_handler_index) != CY_RSLT_SUCCESS)
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "sta link event registration failed \n");
            }
            /* Reset retry-backoff-timeout */
            retry_backoff_timeout = DEFAULT_RETRY_BACKOFF_TIMEOUT_IN_MS;
            goto exit;
        }
        else
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "whd_wifi_join failed : %ld \n", join_result);
            connection_status = CY_WCM_EVENT_CONNECT_FAILED;
            res = cy_worker_thread_enqueue(&cy_wcm_worker_thread, notify_connection_status, (void *)connection_status);
            if(res != CY_RSLT_SUCCESS)
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to send connection status. Err = [%lu]\r\n", res);
            }
        }

