Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/cy_wcm.c
        if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Mutex release error \n");
            return;
        }
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);
    }

    /* Register retry with network worker thread */
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "L%d : %s() : Retrying to join with back-off [%ld milliseconds]\r\n", __LINE__, __FUNCTION__, retry_backoff_timeout);
    res = cy_rtos_start_timer(&sta_retry_timer, retry_backoff_timeout);
    if (res != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "L%d : %s() : ERROR : Failed in join retry with back-off. Err = [%ld]\r\n", __LINE__, __FUNCTION__, res);
    }
    /* Update backoff timeout */
    retry_backoff_timeout = (retry_backoff_timeout < MAX_RETRY_BACKOFF_TIMEOUT_IN_MS)? (uint32_t)(retry_backoff_timeout * 2) : MAX_RETRY_BACKOFF_TIMEOUT_IN_MS;
    return;

exit:
    if (cy_rtos_set_mutex(&wcm_mutex) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Mutex release error \n");
        return;
    }
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex unlocked %s %d\r\n", __FILE__, __LINE__);
}

static void lwip_ip_change_callback(cy_network_interface_context *iface_context, void *arg)
{
    UNUSED_PARAMETER(arg);
    cy_rslt_t result;
    if(!wcm_sta_link_up)
    {
        return;
    }
    result = cy_worker_thread_enqueue(&cy_wcm_worker_thread, notify_ip_change, NULL);
    if (result != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "L%d : %s() : Failed to send async event to n/w worker thread. Err = [%lu]\r\n", __LINE__, __FUNCTION__, result);
    }
}
void notify_ip_change(void *arg)
{
    cy_wcm_event_data_t link_event_data;
    cy_rslt_t res = CY_RSLT_SUCCESS;
    cy_nw_ip_address_t ipv4_addr;
    UNUSED_PARAMETER(arg);

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Notify application that ip has changed!\n");
    memset(&link_event_data, 0, sizeof(cy_wcm_event_data_t));
    res = cy_network_get_ip_address(nw_sta_if_ctx, &ipv4_addr);

    if (res == CY_RSLT_SUCCESS)
    {
        link_event_data.ip_addr.version = CY_WCM_IP_VER_V4;
        link_event_data.ip_addr.ip.v4   = ipv4_addr.ip.v4;
        invoke_app_callbacks(CY_WCM_EVENT_IP_CHANGED, &link_event_data);
    }
}


static bool check_if_platform_supports_band(whd_interface_t interface, cy_wcm_wifi_band_t requested_band)
{
    whd_band_list_t band_list;
    uint32_t res;

    res = whd_wifi_get_ioctl_buffer(interface, WLC_GET_BANDLIST, (uint8_t*)&band_list, sizeof(whd_band_list_t));
    if(res != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Function whd_wifi_get_ioctl_buffer failed at line %d with result %u \n ", __LINE__, res);
        return false;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "band_list.current_band = %ld, band_list.number_of_bands = %ld , requested band = %d \n ", band_list.current_band, band_list.number_of_bands, requested_band);

     /*
      * All CY chips which supports 5Ghz will also support 2.4Ghz and
      * for such platforms number of bands will be 2
      */
    if(band_list.number_of_bands == 1)
    {
        if(requested_band == CY_WCM_WIFI_BAND_2_4GHZ || requested_band == CY_WCM_WIFI_BAND_ANY)
        {
            return true;
        }
        else
        {
            return false;
        }
    }
    else if(band_list.number_of_bands == 2)
    {
       /* WAR, H2 FW still have some issue for band_list so skip check first */  
       //if((requested_band == band_list.other_band[0]) || (requested_band == band_list.other_band[1]))
            return true;
    }
    return true;
}

static cy_rslt_t network_up(whd_interface_t interface, cy_network_hw_interface_type_t iface_type, cy_network_static_ip_addr_t *static_ip_ptr)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    if(iface_type == CY_NETWORK_WIFI_STA_INTERFACE)
    {
        if(is_sta_interface_created == false)
        {
            res = cy_network_add_nw_interface(CY_NETWORK_WIFI_STA_INTERFACE, 0, whd_ifs[CY_WCM_INTERFACE_TYPE_STA], NULL, static_ip_ptr, &nw_sta_if_ctx);
            if (res != CY_RSLT_SUCCESS)
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to add the network interface \n");
                return res;
            }
            is_sta_interface_created = true;
        }
        if((res = cy_network_ip_up(nw_sta_if_ctx)) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to bring up the network stack \n");
            if(cy_network_remove_nw_interface(nw_sta_if_ctx) != CY_RSLT_SUCCESS)
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to remove the network interface \n");
            }
            is_sta_interface_created = false;
            return res;
        }
        is_sta_network_up = true;
    }
    else if(iface_type == CY_NETWORK_WIFI_AP_INTERFACE)
    {
        res = cy_network_add_nw_interface(CY_NETWORK_WIFI_AP_INTERFACE, 0, whd_ifs[CY_WCM_INTERFACE_TYPE_AP], NULL, static_ip_ptr, &nw_ap_if_ctx);
        if (res != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to add the network interface \n");
            return res;
        }
        if((res = cy_network_ip_up(nw_ap_if_ctx)) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to bring up the network stack \n");
            if(cy_network_remove_nw_interface(nw_ap_if_ctx) != CY_RSLT_SUCCESS)
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to remove the network interface \n");
            }
            return res;
        }
        is_ap_network_up = true;
    }
    return res;
}

static void network_down(whd_interface_t interface, cy_network_hw_interface_type_t iface_type)
{
    if(iface_type == CY_NETWORK_WIFI_STA_INTERFACE)
    {
        cy_network_ip_down(nw_sta_if_ctx);
        is_sta_network_up = false;
        cy_network_remove_nw_interface(nw_sta_if_ctx);
        is_sta_interface_created = false;
    }
    else
    {
        cy_network_ip_down(nw_ap_if_ctx);
        cy_network_remove_nw_interface(nw_ap_if_ctx);
        is_ap_network_up = false;
    }
}

