Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/cy_wcm.c
static whd_security_t wcm_to_whd_security(cy_wcm_security_t sec)
{
    switch(sec)
    {
        case CY_WCM_SECURITY_OPEN :
            return WHD_SECURITY_OPEN;

        case CY_WCM_SECURITY_WEP_PSK:
            return WHD_SECURITY_WEP_PSK;

        case CY_WCM_SECURITY_WEP_SHARED:
            return WHD_SECURITY_WEP_SHARED;

        case CY_WCM_SECURITY_WPA_TKIP_PSK:
            return WHD_SECURITY_WPA_TKIP_PSK;

        case CY_WCM_SECURITY_WPA_AES_PSK:
            return WHD_SECURITY_WPA_AES_PSK;

        case CY_WCM_SECURITY_WPA_MIXED_PSK:
            return WHD_SECURITY_WPA_MIXED_PSK;

        case CY_WCM_SECURITY_WPA2_AES_PSK:
            return WHD_SECURITY_WPA2_AES_PSK;

        case CY_WCM_SECURITY_WPA2_AES_PSK_SHA256:
            return WHD_SECURITY_WPA2_AES_PSK_SHA256;

        case CY_WCM_SECURITY_WPA2_TKIP_PSK:
            return WHD_SECURITY_WPA2_TKIP_PSK;

        case CY_WCM_SECURITY_WPA2_MIXED_PSK:
            return WHD_SECURITY_WPA2_MIXED_PSK;

        case CY_WCM_SECURITY_WPA2_FBT_PSK:
            return WHD_SECURITY_WPA2_FBT_PSK;

        case CY_WCM_SECURITY_WPA3_SAE:
            return WHD_SECURITY_WPA3_SAE;

        case CY_WCM_SECURITY_WPA2_WPA_AES_PSK:
            return WHD_SECURITY_WPA2_WPA_AES_PSK;

        case CY_WCM_SECURITY_WPA2_WPA_MIXED_PSK:
            return WHD_SECURITY_WPA2_WPA_MIXED_PSK;

        case CY_WCM_SECURITY_WPA3_WPA2_PSK:
            return WHD_SECURITY_WPA3_WPA2_PSK;

        case CY_WCM_SECURITY_WPA_TKIP_ENT:
            return WHD_SECURITY_WPA_TKIP_ENT;

        case CY_WCM_SECURITY_WPA_AES_ENT:
            return WHD_SECURITY_WPA_AES_ENT;

        case CY_WCM_SECURITY_WPA_MIXED_ENT:
            return WHD_SECURITY_WPA_MIXED_ENT;

        case CY_WCM_SECURITY_WPA2_TKIP_ENT:
            return WHD_SECURITY_WPA2_TKIP_ENT;

        case CY_WCM_SECURITY_WPA2_AES_ENT:
            return WHD_SECURITY_WPA2_AES_ENT;

        case CY_WCM_SECURITY_WPA2_MIXED_ENT:
            return WHD_SECURITY_WPA2_MIXED_ENT;

        case CY_WCM_SECURITY_WPA2_FBT_ENT:
            return WHD_SECURITY_WPA2_FBT_ENT;

        case CY_WCM_SECURITY_IBSS_OPEN:
            return WHD_SECURITY_IBSS_OPEN;

        case CY_WCM_SECURITY_WPS_SECURE:
            return WHD_SECURITY_WPS_SECURE;

        default:
            return WHD_SECURITY_UNKNOWN;
    }
}

static cy_wcm_security_t whd_to_wcm_security(whd_security_t sec)
{
    switch(sec)
    {
        case WHD_SECURITY_OPEN:
            return CY_WCM_SECURITY_OPEN;

        case WHD_SECURITY_WEP_PSK:
            return CY_WCM_SECURITY_WEP_PSK;

        case WHD_SECURITY_WEP_SHARED:
            return CY_WCM_SECURITY_WEP_SHARED;

        case WHD_SECURITY_WPA_TKIP_PSK:
            return CY_WCM_SECURITY_WPA_TKIP_PSK;

        case WHD_SECURITY_WPA_AES_PSK:
            return CY_WCM_SECURITY_WPA_AES_PSK;

        case WHD_SECURITY_WPA_MIXED_PSK:
            return CY_WCM_SECURITY_WPA_MIXED_PSK;

        case WHD_SECURITY_WPA2_AES_PSK_SHA256:
            return CY_WCM_SECURITY_WPA2_AES_PSK_SHA256;

        case WHD_SECURITY_WPA2_AES_PSK:
            return CY_WCM_SECURITY_WPA2_AES_PSK;

        case WHD_SECURITY_WPA2_TKIP_PSK:
            return CY_WCM_SECURITY_WPA2_TKIP_PSK;

        case WHD_SECURITY_WPA2_MIXED_PSK:
            return CY_WCM_SECURITY_WPA2_MIXED_PSK;

        case WHD_SECURITY_WPA2_FBT_PSK:
            return CY_WCM_SECURITY_WPA2_FBT_PSK;

        case WHD_SECURITY_WPA3_SAE:
            return CY_WCM_SECURITY_WPA3_SAE;

        case WHD_SECURITY_WPA2_WPA_AES_PSK:
            return CY_WCM_SECURITY_WPA2_WPA_AES_PSK;

        case WHD_SECURITY_WPA2_WPA_MIXED_PSK:
            return CY_WCM_SECURITY_WPA2_WPA_MIXED_PSK;

        case WHD_SECURITY_WPA3_WPA2_PSK:
            return CY_WCM_SECURITY_WPA3_WPA2_PSK;

        case WHD_SECURITY_WPA_TKIP_ENT:
            return CY_WCM_SECURITY_WPA_TKIP_ENT;

        case WHD_SECURITY_WPA_AES_ENT:
            return CY_WCM_SECURITY_WPA_AES_ENT;

        case WHD_SECURITY_WPA_MIXED_ENT:
            return CY_WCM_SECURITY_WPA_MIXED_ENT;

        case WHD_SECURITY_WPA2_TKIP_ENT:
            return CY_WCM_SECURITY_WPA2_TKIP_ENT;

        case WHD_SECURITY_WPA2_AES_ENT:
            return CY_WCM_SECURITY_WPA2_AES_ENT;

        case WHD_SECURITY_WPA2_MIXED_ENT:
            return CY_WCM_SECURITY_WPA2_MIXED_ENT;

        case WHD_SECURITY_WPA2_FBT_ENT:
            return CY_WCM_SECURITY_WPA2_FBT_ENT;

        case WHD_SECURITY_IBSS_OPEN:
            return CY_WCM_SECURITY_IBSS_OPEN;

        case WHD_SECURITY_WPS_SECURE:
            return CY_WCM_SECURITY_WPS_SECURE;

        default:
            return CY_WCM_SECURITY_UNKNOWN;
    }
}

static cy_wcm_wifi_band_t whd_to_wcm_band(whd_802_11_band_t band)
{
    if(band == WHD_802_11_BAND_5GHZ)
    {
        return CY_WCM_WIFI_BAND_5GHZ;
    }
    else if(band == WHD_802_11_BAND_2_4GHZ)
    {
        return CY_WCM_WIFI_BAND_2_4GHZ;
    }
    else
    {
        return CY_WCM_WIFI_BAND_6GHZ;
    }
}

static cy_wcm_bss_type_t whd_to_wcm_bss_type(whd_bss_type_t bss_type)
{
    switch(bss_type)
    {
        case WHD_BSS_TYPE_INFRASTRUCTURE:
            return CY_WCM_BSS_TYPE_INFRASTRUCTURE;

        case WHD_BSS_TYPE_ADHOC:
            return CY_WCM_BSS_TYPE_ADHOC;

        case WHD_BSS_TYPE_ANY:
            return CY_WCM_BSS_TYPE_ANY;

        case WHD_BSS_TYPE_MESH:
            return CY_WCM_BSS_TYPE_MESH;

        default :
            return CY_WCM_BSS_TYPE_UNKNOWN;
    }
}

static void read_ap_config(const cy_wcm_ap_config_t *ap_config, whd_ssid_t *ssid,
                              uint8_t **key, uint8_t *keylen, whd_security_t *security, cy_network_static_ip_addr_t *static_ip_addr)
{
    ssid->length = (uint8_t)strlen((char*)ap_config->ap_credentials.SSID);
    memcpy(&ssid->value, ap_config->ap_credentials.SSID, ssid->length + 1);

    *keylen = strlen((char*)ap_config->ap_credentials.password);
    *key = (uint8_t*)ap_config->ap_credentials.password;
    *security = wcm_to_whd_security(ap_config->ap_credentials.security);

    memset(static_ip_addr, 0, sizeof(cy_network_static_ip_addr_t));
    if(ap_config->ip_settings.gateway.version == CY_WCM_IP_VER_V4)
    {
        static_ip_addr->gateway.ip.v4 = ap_config->ip_settings.gateway.ip.v4;
        static_ip_addr->addr.ip.v4    = ap_config->ip_settings.ip_address.ip.v4;
        static_ip_addr->netmask.ip.v4 = ap_config->ip_settings.netmask.ip.v4;
    }
}

static cy_rslt_t check_soft_ap_config(const cy_wcm_ap_config_t *ap_config_params)
{
    uint8_t ssid_len;
    uint8_t pwd_len;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    whd_interface_t prim_ifp;
    if(whd_ifs[CY_WCM_INTERFACE_TYPE_AP] == NULL)
    {
        return CY_RSLT_WCM_INTERFACE_NOT_UP;
    }
    /* In concurrent mode (AP+STA), use the primary interface(STA) to get the band-list and channel_list, as only the
     * primary interface is initialized at this point.
     * This is as per the recommendation provided by WHD.
     * Note: This does not affect the AP mode since the primary interface will be the AP interface itself.
     */
    prim_ifp = whd_get_primary_interface(whd_ifs[CY_WCM_INTERFACE_TYPE_AP]->whd_driver);

    if(ap_config_params == NULL)
    {
        return CY_RSLT_WCM_BAD_ARG;
    }

    ssid_len = (uint8_t)strlen((char*)ap_config_params->ap_credentials.SSID);
    pwd_len  = (uint8_t)strlen((char*)ap_config_params->ap_credentials.password);

    if(ap_config_params->ip_settings.ip_address.ip.v4 == 0)
    {
        return CY_RSLT_WCM_BAD_STATIC_IP;
    }

    if(ssid_len == 0 || ssid_len > CY_WCM_MAX_SSID_LEN )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "SSID length error\n");
        return CY_RSLT_WCM_BAD_SSID_LEN;
    }

    if(!check_wcm_security(ap_config_params->ap_credentials.security))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "AP credentials security error\n");
        return CY_RSLT_WCM_SECURITY_NOT_SUPPORTED;
    }

    if((ap_config_params->ap_credentials.security != CY_WCM_SECURITY_OPEN) &&
       (pwd_len < CY_WCM_MIN_PASSPHRASE_LEN || pwd_len > CY_WCM_MAX_PASSPHRASE_LEN))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "AP credentials passphrase length error. Length must be between 8 and 63\n");
        return CY_RSLT_WCM_BAD_PASSPHRASE_LEN;
    }

    if(ap_config_params->ie_info != NULL)
    {
        if(ap_config_params->ie_info->data == NULL)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid IE \n");
            return CY_RSLT_WCM_INVALID_IE;
        }
    }

