Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/cy_wcm.c
    /*
     * Validate the band and update the appropriate error code
     * channel number 1 to 11 is 2G
     * channel number 36 to 165 is 5G
     * channel number 1 to 233 is 6G
     */
    do
    {
        if(ap_config_params->band != CY_WCM_WIFI_BAND_6GHZ)
        {
            if((ap_config_params->channel > 0) && (ap_config_params->channel < 12))
            {
                /* All platforms by default supports 2.4Ghz so return success*/
                break;
            }
            else if((ap_config_params->channel > 35) && (ap_config_params->channel < 166))
            {
                if(!check_if_platform_supports_band(prim_ifp, CY_WCM_WIFI_BAND_5GHZ))
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "5GHz band not supported \n");
                    result = CY_RSLT_WCM_BAND_NOT_SUPPORTED;
                    break;
                }
            }
            else
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid channel. Channel not in expected range \n");
                result = CY_RSLT_WCM_AP_BAD_CHANNEL;
                break;
            }
        }
        else
        {
            /* For 6GHz band */
            if((ap_config_params->channel > 0) && (ap_config_params->channel < 234))
            {
                if(!check_if_platform_supports_band(prim_ifp, CY_WCM_WIFI_BAND_6GHZ))
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "6GHz band not supported \n");
                    result = CY_RSLT_WCM_BAND_NOT_SUPPORTED;
                    break;
                }
            }
        }
    }while(0);

    /*
     * Validate if the given channel is supported on the kit and update appropriate error codes.
     */
    if(result == CY_RSLT_SUCCESS)
    {
        whd_list_t *whd_channel_list;
        uint32_t channel_buf[ MAXCHANNEL+1 ];
        whd_channel_list = (whd_list_t *)(void *)channel_buf;
        uint8_t index;
        cy_rslt_t res;

        whd_channel_list->count = MAXCHANNEL;  /* Initialize to maximum channels that can be supported as defined in WHD */

        (void)whd_wifi_set_ioctl_value(prim_ifp, WLC_SET_BAND, ap_config_params->band);

        res = whd_wifi_get_channels(prim_ifp, whd_channel_list);
        if(res != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "whd_wifi_get_channels failed \n");
            return CY_RSLT_WCM_BAD_ARG;
        }

        for(index = 0; index < whd_channel_list->count; index++)
        {
            if(ap_config_params->channel == *(whd_channel_list->element+index))
            {
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Input channel is supported \n");
                break;
            }
        }
        if(index == whd_channel_list->count)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid Channel \n");
            return CY_RSLT_WCM_AP_BAD_CHANNEL;
        }
    }

    return result;
}

static cy_rslt_t init_whd_wifi_interface(cy_wcm_interface_t iface_type)
{

    if(iface_type != CY_WCM_INTERFACE_TYPE_AP_STA)
    {
        if (cybsp_wifi_init_primary(&whd_ifs[iface_type]) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error in initializing primary interface !!\n");
            return CY_RSLT_WCM_BSP_INIT_ERROR;
        }

    }
    else
    {
        /* In concurrent mode primary interface would be STA and secondary AP*/
        if (cybsp_wifi_init_primary(&whd_ifs[CY_WCM_INTERFACE_TYPE_STA]) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error in getting primary interface mac address !!\n");
            return CY_RSLT_WCM_BSP_INIT_ERROR;
        }

        /* SoftAP is the secondary interface in Concurrent mode*/
        if(cybsp_wifi_init_secondary(&whd_ifs[CY_WCM_INTERFACE_TYPE_AP], NULL) != CY_RSLT_SUCCESS)
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error Unable to bring up the secondary interface !!\n");
            return CY_RSLT_WCM_SECONDARY_INTERFACE_ERROR;
        }
    }
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_wcm_get_whd_interface(cy_wcm_interface_t interface_type, whd_interface_t *whd_iface)
{
    if(whd_iface == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : bad arguments \n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    if(!is_wcm_initalized)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "WCM is not initialized. Call cy_wcm_init() to initialize \n");
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    if((interface_type != CY_WCM_INTERFACE_TYPE_STA) || (current_interface == CY_WCM_INTERFACE_TYPE_AP))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Supported only for STA interface !!\n");
        return CY_RSLT_WCM_INTERFACE_NOT_SUPPORTED;
    }

    *whd_iface = whd_ifs[interface_type];
    return CY_RSLT_SUCCESS;
}

static bool check_if_ent_auth_types(cy_wcm_security_t auth_type)
{
    if((auth_type == CY_WCM_SECURITY_WPA_TKIP_ENT) || (auth_type == CY_WCM_SECURITY_WPA_AES_ENT) ||
       (auth_type == CY_WCM_SECURITY_WPA_MIXED_ENT) || (auth_type == CY_WCM_SECURITY_WPA2_TKIP_ENT) ||
       (auth_type == CY_WCM_SECURITY_WPA2_AES_ENT) || (auth_type == CY_WCM_SECURITY_WPA2_MIXED_ENT) ||
       (auth_type == CY_WCM_SECURITY_WPA2_FBT_ENT))
    {
        return true;
    }

    return false;
}

cy_rslt_t cy_wcm_set_ap_ip_setting(cy_wcm_ip_setting_t *ap_ip, const char *ip_addr, const char *netmask, const char *gateway_addr, cy_wcm_ip_version_t ver)
{
    cy_rslt_t          res = CY_RSLT_SUCCESS;
    cy_nw_ip_address_t temp;

    if(ap_ip == NULL || ip_addr == NULL || netmask == NULL || gateway_addr == NULL)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Null value passed to cy_wcm_ap_ip_setting \n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    if((ver != CY_WCM_IP_VER_V4) && (ver != CY_WCM_IP_VER_V6))
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Invalid version passed to cy_wcm_set_ap_ip_setting \n");
        return CY_RSLT_WCM_BAD_ARG;
    }

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "wcm mutex locked %s %d\r\n", __FILE__, __LINE__);
    if((res = cy_rtos_get_mutex(&wcm_mutex, CY_WCM_MAX_MUTEX_WAIT_TIME_MS)) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to acquire WCM mutex \n");
        return res;
    }

    cy_nw_aton(ip_addr,&temp);
    ap_ip->ip_address.ip.v4 =  temp.ip.v4;

