Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/wifi-connection-manager/source/cy_wcm.c
    cy_nw_aton(netmask,&temp);
    ap_ip->netmask.ip.v4 =  temp.ip.v4;

    cy_nw_aton(gateway_addr,&temp);
    ap_ip->gateway.ip.v4 =  temp.ip.v4;

    ap_ip->ip_address.version = ver;
    ap_ip->netmask.version = ver;
    ap_ip->gateway.version = ver;

    if ((res = cy_rtos_set_mutex(&wcm_mutex)) != CY_RSLT_SUCCESS)
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to release WCM mutex \n");
    }
    return res;
}

cy_rslt_t cy_wcm_allow_low_power_mode(cy_wcm_powersave_mode_t mode)
{
    cy_rslt_t       rslt = CY_RSLT_SUCCESS;
    whd_interface_t ifp = NULL;
    uint16_t        wlan_chip_id = 0;

    if (cy_wcm_get_whd_interface(CY_WCM_INTERFACE_TYPE_STA, &ifp) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_WCM_NOT_INITIALIZED;
    }

    /* get chip ID */
    wlan_chip_id = whd_chip_get_chip_id(ifp->whd_driver);

    /* Disable WLAN PM/mpc for 43907 low power issue */
    if ( (wlan_chip_id == CY_WCM_WLAN_CHIP_ID_43909) || (wlan_chip_id == CY_WCM_WLAN_CHIP_ID_43907) || (wlan_chip_id == CY_WCM_WLAN_CHIP_ID_54907) )
    {
        switch (mode)
        {
            case CY_WCM_NO_POWERSAVE_MODE:
                rslt = whd_wifi_disable_powersave(ifp);
                if (rslt == WHD_SUCCESS)
                {
                    rslt = whd_wifi_set_iovar_value(ifp, IOVAR_STR_MPC, 0);
                }
                break;
            case CY_WCM_PM1_POWERSAVE_MODE:    /*  Powersave mode on specified interface without regard for throughput reduction */
                rslt = whd_wifi_enable_powersave(ifp);
                if (rslt == WHD_SUCCESS)
                {
                    rslt = whd_wifi_set_iovar_value(ifp, IOVAR_STR_MPC, 1);
                }
                break;
            case CY_WCM_PM2_POWERSAVE_MODE:    /* Powersave mode on specified interface with High throughput */
                rslt = whd_wifi_enable_powersave_with_throughput(ifp, DEFAULT_PM2_SLEEP_RET_TIME);
                if (rslt == WHD_SUCCESS)
                {
                    rslt = whd_wifi_set_iovar_value(ifp, IOVAR_STR_MPC, 1);
                }
                break;
            default:
                rslt = CY_RSLT_WCM_BAD_ARG;
                break;
        }

        if (rslt != WHD_SUCCESS)
        {
            WPRINT_WHD_ERROR( ("Failed to change powersave mode.\n") );
        }
    }
    else
    {
        rslt = CY_RSLT_WCM_POWERSAVE_MODE_NOT_SUPPORTED;
    }
    return rslt;
}

#endif
